/*! @file
********************************************************************************
<PRE>
文件实现功能   : 聚合所有模块的状态管理信息, 并创建状态管理对象
作者           : dotdancer
版本           : 1.0
--------------------------------------------------------------------------------
备注           : -
--------------------------------------------------------------------------------
修改记录 :
日  期       版本    修改人     修改内容
2022/04/13   1.0     dotdancer  创建 
</PRE>
*******************************************************************************/
import { createStore, Store } from 'vuex'

export const initStore: () => Store<any> = () => {
    // =========================================================================
    // = 定义基础平台的状态管理信息
    const baseStore = {
        state: {
            count: 0
        },
        mutations: {
            add(state: {count: number}){
                state.count++
            }
        }
    }
    
    // =========================================================================
    // = 聚合扩展模块的路由
    const modules: GlobalType.ARecord = {
        base: baseStore, 
        ...app.getAllBModStores(),
    }
    
    // =========================================================================
    // = 定义基础平台的状态管理信息
    return createStore({
        modules,
    })
}