import router from './router'
import { mergeLpk } from '@/config/lpk'

// =============================================================================
// = 模块初始化
const stModuleName = 'blog'
export const entryInit = async () => {
    // -------------------------------------------------------------------------
    // - 如果未开启当前模块, 终止初始化当前模块内容
    if (!app.checkBModIsEnable(stModuleName)){
        return
    }

    // -------------------------------------------------------------------------
    // - 初始化当前模块的语言包
    mergeLpk(import.meta.globEager('./locales/*'))

    // -------------------------------------------------------------------------
    // - 初始化当前模块的配置信息

    // -------------------------------------------------------------------------
    // - 初始化当前模块的路由

    // -------------------------------------------------------------------------
    // - 初始化当前模块的状态管理信息

    console.log('blog init')
}